using LibDatabaseParameters;
using LibParameters;

namespace SupportToolsData.Models;

public sealed class DatabasesParameters : ParametersWithStatus
{
    //შემდეგი 2 პარამეტრიდან გამოიყენება ერთერთი
    //ორივეს ერთდროულად შევსება არ შეიძლება.
    //ორივეს ცარელა დატოვება არ შეიძლება
    //მონაცემთა ბაზასთან კავშირის სახელი
    public string? DbConnectionName { get; set; }

    //მონაცემთა ბაზასთან დამაკავშირებელი ვებაგენტის სახელი
    public string? DbWebAgentName { get; set; }

    //ბექაპირების პარამეტრები სერვერის მხარეს
    public DatabaseBackupParametersModel? DbBackupParameters { get; set; }

    //ფოლდერის ნიკი, რომელშიც უნდა მოხდეს ბექაპის შენახვა
    //(სერვერზე წინასწარ უნდა იყოს დაკონფიგურებული ფოლდერების ნიკები და შესაძლებელი უნდა იყოს რედაქტირების დროს მოტვირთვა)
    public string? DbServerSideBackupPath { get; set; }

    //ფოლდერის ნიკი, რომელშიც უნდა მოხდეს ბაზის მონაცემების ფაილის აღდგენა
    //(სერვერზე წინასწარ უნდა იყოს დაკონფიგურებული ფოლდერების ნიკები და შესაძლებელი უნდა იყოს რედაქტირების დროს მოტვირთვა)
    public string? DbServerSideDataFolderPath { get; set; }

    //ფოლდერის ნიკი, რომელშიც უნდა მოხდეს ბაზის ლოგების ფაილის აღდგენა
    //(სერვერზე წინასწარ უნდა იყოს დაკონფიგურებული ფოლდერების ნიკები და შესაძლებელი უნდა იყოს რედაქტირების დროს მოტვირთვა)
    public string? DbServerSideLogFolderPath { get; set; }

    //მიმდინარე ბაზის სახელი
    //ბაზების სახელების მოტვირთვა შესაძლებელი უნდა იყოს რედაქტირების დროს
    //public string? CurrentBaseName { get; set; }

    //ახალი ბაზის სახელი, რომელიც უნდა შეიქმნას განახლების დროს
    //თუ განსხვავდება მიმდინარე სახელისგან, ეს ნიშნავს, რომ გვჭირდება მიმდინარე ბაზის შენარჩუნება
    //ხოლო ახალი ბაზისათვის მზად არის ახალი პროგრამა.
    //მას მერე, რაც საჭიროება აღარ იქნება, CurrentBaseName და NewBaseName სახელები ერთმანეთს უნდა დაემთხვას.
    //ბაზების სახელების მოტვირთვა შესაძლებელი უნდა იყოს რედაქტირების დროს
    public string? DatabaseName { get; set; }

    //ჭკვიანი სქემის სახელი. გამოიყენება ძველი დასატოვებელი და წასაშლელი ფაილების განსასაზღვრად. (ბაზის სერვერის მხარეს)
    //ბაზის სერვერის მხარეს არსებული ჭკვიანი სქემის სახელებიუს მოტვირთვა შესაძლებელი უნდა იყოს რედაქტირების დროს
    public string? SmartSchemaName { get; set; }

    //სერვერის მხარეს ფაილსაცავის ნიკი
    //ბაზის ბექაპების გაცვლისათვის გამოსადეგი ფაილსაცავების ნიკების მოტვირთვა შესაძლებელი უნდა იყოს რედაქტირების დროს
    public string? FileStorageName { get; set; }
}