namespace SupportToolsData;

public enum EProjectTools
{
    //-------------------------------------------------------------------------------
    //პროექტზე დამოკიდებული ინსტრუმენტები. (გამოიყენება დეველოპმენტის დროს და არ არის დამოკიდებული სერვერზე
    CorrectNewDatabase, //მიგრაციით ახლად შექმნილი მონაცემთა ბაზის კორექტირება, იმისათვის რომ ზოგიერთი არასასურველი კონსტრუქცია შეიცვალოს ისე, როგორც საჭიროა

    CreateDevDatabaseByMigration, //მიგრაციის საშუალებით ცარელა დეველოპერ ბაზის შექმნა
    RecreateDevDatabase, //აერთიანებს სამ ოპერაციას, ანუ წაშლის დეველოპერ ბაზას, შექმნის ახალ ცარელა ბაზას მიგრაციის მიხედვით და დააკორექტირებს არასასურველ კონსტრუქციებს ბაზაში.

    DropDevDatabase, //დეველოპერ ბაზის წაშლა
    AnaliseDevDatabase, //დეველოპერ ბაზის გაანალიზება
    AnaliseProdCopyDatabase, //პროდუქშენ ბაზის ასლის გაანალიზება
    JetBrainsCleanupCode, //jb cleanupcode solutionFileName.sln -> JetBrain-ის უტილიტის გაშვება პროექტის სოლუშენის ფაილის მითითებით კოდის გასაწმენდად და მოსაწესრიგებლად

    //AllowToolsList პარამეტრების ფაილში რიცხვებით ინახება, ამიტომ ინსტრუმენტების ნომრები არ უნდა შეიცვალოს. 7-10
    //ScaffoldSeeder-ის მექანიზმის წაშლილ ინსტრუმენტებს ეკავა
    GenerateApiRoutes = 11, //API რაუტების გენერაცია

    PairProdCopyAndDevDbObjects, //ProdCopy და Dev ბაზის ცხრილებისა და ველების სახელების მიხედვით დაწყვილება და დაწყვილებული შესაბამისობების ჯეისონ ფაილში შენახვა

    TransferProdCopyToDevByPairs //ProdCopy → Dev ბაზაში ინფორმაციის პირდაპირი გადატანა დაწყვილებული ცხრილებისა და ველების მიხედვით, scaffolding-ის და კოდის გენერაციის გარეშე
}
