namespace SupportToolsData;

public enum EProjectTools
{
    //-------------------------------------------------------------------------------
    //პროექტზე დამოკიდებული ინსტრუმენტები. (გამოიყენება დეველოპმენტის დროს და არ არის დამოკიდებული სერვერზე
    CorrectNewDatabase, //მიგრაციით ახლად შექმნილი მონაცემთა ბაზის კორექტირება, იმისათვის რომ ზოგიერთი არასასურველი კონსტრუქცია შეიცვალოს ისე, როგორც საჭიროა

    CreateDevDatabaseByMigration, //მიგრაციის საშუალებით ცარელა დეველოპერ ბაზის შექმნა
    RecreateDevDatabase, //აერთიანებს წინა სამ ოპერაციას, ანუ წაშლის დეველოპერ ბაზას, შექმნის ახალ ცარელა ბაზას მიგრაციის მიხედვით და დააკორექტირებს არასასურველ კონსტრუქციებს ბაზაში.

    DropDevDatabase, //დეველოპერ ბაზის წაშლა
    JetBrainsCleanupCode, //jb cleanupcode solutionFileName.sln -> JetBrain-ის უტილიტის გაშვება პროექტის სოლუშენის ფაილის მითითებით კოდის გასაწმენდად და მოსაწესრიგებლად
    JsonFromProjectDbProjectGetter, //არსებული პროდაქშენ ბაზის ასლიდან დაამზადებს json ფაილები თავიდან

    //ScaffoldSeederGitSync, //მხოლოდ გიტის სინქრონიზაცია სკაფოლდ სიდინგ პროექტებისათვის
    ScaffoldSeederCreator, //არსებული პროდაქშენ ბაზის ასლიდან დაამზადებს სკაფოლდ პროექტს და შექმნის ჯეისონ ფაილებს, რომლებიც შემდგომში შესაძლებელი იქნება გამოვიყენოთ სიდინგისათვის. ამ შემქმნელ ამოცანაში შედის კოდის შექმნა, როგორც სკაფოლდინგისათვის, ისე სიდინგისათვის
    SeedData, //scaffold-ით მიღებული ბაზიდან მიღებულ json-ებზე დაყრდნობით ინფორმაციის ჩაყრა დეველოპერ ბაზაში.
    PrepareProdCopyDatabase, //პროდაქშენ ბაზის ასლის მომზადება სკაფოლდით დამუშავებისათვის

    GenerateApiRoutes //API რაუტების გენერაცია
}
